In [1]:
import pandas as pd

In [3]:
data1 = { 
    'names': ['somang', 'jimin', 'jhope', 'rm', 'suga'],
    'year': [2017, 2018, 2020, 1995, 1987],
    'points': [1.5, 1.9, 2.1, 3.3, 5.8]
}
dataframe1 = pd.DataFrame(data1)
dataframe1

    names  points  year
0  somang     1.5  2017
1   jimin     1.9  2018
2   jhope     2.1  2020
3      rm     3.3  1995
4    suga     5.8  1987

In [4]:
dataframe1.year

0    2017
1    2018
2    2020
3    1995
4    1987
Name: year, dtype: int64

In [5]:
dataframe1.points

0    1.5
1    1.9
2    2.1
3    3.3
4    5.8
Name: points, dtype: float64

In [6]:
dataframe1.names

0    somang
1     jimin
2     jhope
3        rm
4      suga
Name: names, dtype: object

In [13]:
dataframe1[['names', 'year']]

    names  year
0  somang  2017
1   jimin  2018
2   jhope  2020
3      rm  1995
4    suga  1987

In [16]:
# 에러
# dataframe1['names':'points']
# dataframe1[1]

In [14]:
# 에러는 아니지만 열 번호가 아닌 행 번호로 인식
dataframe1[0:2]

    names  points  year
0  somang     1.5  2017
1   jimin     1.9  2018

In [18]:
dataframe1[0:3]

    names  points  year
0  somang     1.5  2017
1   jimin     1.9  2018
2   jhope     2.1  2020

In [21]:
dataframe1.index = ['one', 'two', 'three' , 'four', 'five']

In [22]:
dataframe1['one':'three']

        names  points  year
one    somang     1.5  2017
two     jimin     1.9  2018
three   jhope     2.1  2020

In [23]:
dataframe1['points'] = [0.1, 0.2, 0.3, 0.4, 0.5]

In [27]:
import numpy as np
dataframe1['rank'] = np.arange(5) # 새로운 column을 추가하고, 그 값은 다른 함수의 return 값을 통해 할당함
dataframe1

        names  points  year  rank
one    somang     0.1  2017     0
two     jimin     0.2  2018     1
three   jhope     0.3  2020     2
four       rm     0.4  1995     3
five     suga     0.5  1987     4

In [29]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
dataframe1['debt'] = val
dataframe1

        names  points  year  rank  debt
one    somang     0.1  2017     0   NaN
two     jimin     0.2  2018     1  -1.2
three   jhope     0.3  2020     2   NaN
four       rm     0.4  1995     3  -1.5
five     suga     0.5  1987     4  -1.7

In [41]:
dataframe1.penalty = dataframe1.points
dataframe1.points = [2.9, 4.1, 2.0, 0.7, 8.3]
dataframe1

        names  points  year  rank  debt  penalty
one    somang     2.9  2017     0   NaN      0.1
two     jimin     4.1  2018     1  -1.2      0.2
three   jhope     2.0  2020     2   NaN      0.3
four       rm     0.7  1995     3  -1.5      0.4
five     suga     8.3  1987     4  -1.7      0.5

In [50]:
dataframe1['net_points'] = dataframe1['points'] - dataframe1['penalty']
dataframe1

       points  year  rank  debt  penalty  net_points
one       2.9  2017     0   NaN      0.1         2.8
two       4.1  2018     1  -1.2      0.2         3.9
three     2.0  2020     2   NaN      0.3         1.7
four      0.7  1995     3  -1.5      0.4         0.3
five      8.3  1987     4  -1.7      0.5         7.8

In [51]:
dataframe1['high_point'] = dataframe1['points'] > 3.0
dataframe1

       points  year  rank  debt  penalty  net_points  high_point
one       2.9  2017     0   NaN      0.1         2.8       False
two       4.1  2018     1  -1.2      0.2         3.9        True
three     2.0  2020     2   NaN      0.3         1.7       False
four      0.7  1995     3  -1.5      0.4         0.3       False
five      8.3  1987     4  -1.7      0.5         7.8        True

In [52]:
del dataframe1['high_point']
del dataframe1['net_points']
dataframe1

       points  year  rank  debt  penalty
one       2.9  2017     0   NaN      0.1
two       4.1  2018     1  -1.2      0.2
three     2.0  2020     2   NaN      0.3
four      0.7  1995     3  -1.5      0.4
five      8.3  1987     4  -1.7      0.5

In [48]:
# 에러
# del dataframe1.names
# del dataframe1['names']
# del dataframe1['one':'three']
# del dataframe1[1]

In [53]:
dataframe1['two': 'four']

       points  year  rank  debt  penalty
two       4.1  2018     1  -1.2      0.2
three     2.0  2020     2   NaN      0.3
four      0.7  1995     3  -1.5      0.4

In [54]:
dataframe1.loc['two': 'four']

       points  year  rank  debt  penalty
two       4.1  2018     1  -1.2      0.2
three     2.0  2020     2   NaN      0.3
four      0.7  1995     3  -1.5      0.4

In [55]:
dataframe1.iloc[2, 4]

0.3

In [56]:
dataframe1.iloc[0, 3]

nan

In [58]:
dataframe1.loc['six', :] = [2.3, 2021, 'jk', 6, 0.0]

In [59]:
dataframe1

       points    year rank  debt  penalty
one       2.9  2017.0    0   NaN      0.1
two       4.1  2018.0    1  -1.2      0.2
three     2.0  2020.0    2   NaN      0.3
four      0.7  1995.0    3  -1.5      0.4
five      8.3  1987.0    4  -1.7      0.5
six       2.3  2021.0   jk   6.0      0.0

In [61]:
dataframe1['year'] = dataframe1['year'].astype('int32')
dataframe1

       points  year rank  debt  penalty
one       2.9  2017    0   NaN      0.1
two       4.1  2018    1  -1.2      0.2
three     2.0  2020    2   NaN      0.3
four      0.7  1995    3  -1.5      0.4
five      8.3  1987    4  -1.7      0.5
six       2.3  2021   jk   6.0      0.0

In [62]:
dataframe1.iloc[1, 0:2]

points     4.1
year      2018
Name: two, dtype: object

In [63]:
dataframe1.iloc[[1, 3, 5], [0, 1]]

      points  year
two      4.1  2018
four     0.7  1995
six      2.3  2021

In [65]:
dataframe1['names'] = ['somang', 'jk', 'jimin', 'rm', 'suga', 'jhope']

In [66]:
dataframe1

       points  year rank  debt  penalty   names
one       2.9  2017    0   NaN      0.1  somang
two       4.1  2018    1  -1.2      0.2      jk
three     2.0  2020    2   NaN      0.3   jimin
four      0.7  1995    3  -1.5      0.4      rm
five      8.3  1987    4  -1.7      0.5    suga
six       2.3  2021   jk   6.0      0.0   jhope

In [67]:
dataframe1['year'] > 2017

one      False
two       True
three     True
four     False
five     False
six       True
Name: year, dtype: bool

In [68]:
dataframe1.loc[dataframe1['year'] > 2017, :] # 조건에 맞는 행을 찾아 모든 열 반환

       points  year rank  debt  penalty  names
two       4.1  2018    1  -1.2      0.2     jk
three     2.0  2020    2   NaN      0.3  jimin
six       2.3  2021   jk   6.0      0.0  jhope

In [70]:
dataframe1.loc[dataframe1['names'] == 'jimin', ['names', 'points']] # 조건에 맞는 행을 찾아 특정 열 반환

       names  points
three  jimin     2.0

In [72]:
dataframe1.loc[(dataframe1.points > 3) & (dataframe1.points < 9), :]

      points  year rank  debt  penalty names
two      4.1  2018    1  -1.2      0.2    jk
five     8.3  1987    4  -1.7      0.5  suga

In [77]:
dataframe1.loc[dataframe1['points'] > 5, 'penalty'] = 0 # 조건에 맞는 행의 특정 열에 값을 할당

In [78]:
dataframe1

       points  year rank  debt  penalty   names
one       2.9  2017    0   NaN      0.1  somang
two       4.1  2018    1  -1.2      0.2      jk
three     2.0  2020    2   NaN      0.3   jimin
four      0.7  1995    3  -1.5      0.4      rm
five      8.3  1987    4  -1.7      0.0    suga
six       2.3  2021   jk   6.0      0.0   jhope